<template>
    <section>
        <h1>О проекте</h1>
        
        <div class="content-wrap">
            <p>
                Этот pet-проект первоанчально являлся тестовым заданием. По ТЗ было неободимо создать тестовый блог
                со следующей фунциональностью:
            </p>
            <ul>
                <li>возможность добавления и редактирования статей</li>
                <li>добавление комментариев</li>
                <li>хранение данных в local storage используя JSON-serialize</li>
            </ul>
            
            <p>
                На текущий момент реализована следующая функциональность:
            </p>
            <ul>
                <li>
                    Для хранения данных используется realtime database Firebase
                </li>
                <li>
                    Регистрация/авторизация через метод аутентификации Email/Password в Firebase с использование JWT
                </li>
                <li>
                    Создание, редактирование статей в авторизованном состоянии
                </li>
                <li>
                    Сохранение статей в избранном в авторизованном состоянии
                </li>
                <li>
                    Написание комментариев с древовидной структурой для авторизованных
                </li>
                <li>
                    Профиль пользователя с его данными, избранным, списком опубликованных статей и архивными статьями
                </li>
            </ul>
        </div>
    
    
    </section>
</template>

<style lang="less">
    .content-wrap {
        p {
            margin: 10px 0 20px;
        }
        
        ul {
            list-style-type: disc;
            list-style-position: inside;
            margin-bottom: 40px;
        }
    }

</style>